{"userDefinedMetadata": {"signature": {"outputs": {"loss:0": {"name": "loss:0"}}}}, "convertedBy": "TensorFlow.js Converter v1.6.0", "format": "graph-model", "modelTopology": {"versions": {}, "node": [{"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv3/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv3/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv4/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv4/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv3/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv3/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv4/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv4/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_1_slice-Slice0/begin", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv3/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv3/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv4/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv4/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "name": "Placeholder", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "data_bn/data_bn/Rsqrt/_0__cf__0", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "data_bn/data_bn/mul_1/_1__cf__1", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv1/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}}, "name": "block0_0_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv2/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}}, "name": "block0_2_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_1_slice-Slice1/begin", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_1_slice-Slice0/size", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_0_reshape0/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_0_reshape1/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}, "name": "block1_0_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv0/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}}, "name": "block1_1_conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}, "name": "block1_1_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}, "name": "block1_2_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}, "name": "block1_4_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv0/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}}, "name": "block1_5_conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}, "name": "block1_5_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv0/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}, "name": "block1_6_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}, "name": "block1_6_conv1/biases", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}, "name": "block1_6_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block1_1_slice-Slice1/begin", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}, "name": "block1_1_slice-Slice0/size", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv0/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}, "name": "block1_7_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block1_0_reshape0/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block1_0_reshape1/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}, "name": "block2_0_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv2/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}, "name": "block2_0_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block2_1_slice-Slice1/begin", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block2_1_slice-Slice0/size", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}}, "name": "block2_3_conv0/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv0/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "conv0/pad_size/paddings", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv1/weights", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}, "name": "block2_3_conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv2/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv2/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_0_concat/axis", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block2_0_reshape0/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_0_transpose/perm", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "block2_0_reshape1/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "464"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv1/weights", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "fc/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv1/biases", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "fc/Reshape/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "fc/weights", "op": "Const"}, {"input": ["Placeholder", "data_bn/data_bn/Rsqrt/_0__cf__0"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "data_bn/data_bn/mul", "op": "Mul"}, {"input": ["data_bn/data_bn/mul", "data_bn/data_bn/mul_1/_1__cf__1"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "data_bn/data_bn/add_1", "op": "Add"}, {"input": ["data_bn/data_bn/add_1", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "conv0/pad_size", "op": "Pad"}, {"input": ["conv0/pad_size", "conv0/weights", "conv0/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}}, "name": "conv0/conv0", "op": "_FusedConv2D"}, {"input": ["conv0/conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "pad_size", "op": "Pad"}, {"input": ["pad_size"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}, "name": "pool0", "op": "MaxPool"}, {"input": ["pool0", "block0_0_conv0/weights", "block0_0_conv0/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block0_0_conv0/block0_0_conv0", "op": "_FusedConv2D"}, {"input": ["pool0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block0_0_conv3/pad_size", "op": "Pad"}, {"input": ["block0_0_conv0/block0_0_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block0_0_conv1/pad_size", "op": "Pad"}, {"input": ["block0_0_conv3/pad_size", "block0_0_conv3/weights", "block0_0_conv3/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}}, "name": "block0_0_conv3/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block0_0_conv1/pad_size", "block0_0_conv1/weights", "block0_0_conv1/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}}, "name": "block0_0_conv1/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block0_0_conv3/depthwise", "block0_0_conv4/weights", "block0_0_conv4/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block0_0_conv4/BiasAdd", "op": "_FusedConv2D"}, {"input": ["block0_0_conv1/depthwise", "block0_0_conv2/weights", "block0_0_conv2/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block0_0_conv2/BiasAdd", "op": "_FusedConv2D"}, {"input": ["block0_0_conv4/BiasAdd", "block0_0_conv2/BiasAdd", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}, "name": "block0_0_concat", "op": "ConcatV2"}, {"input": ["block0_0_concat"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "block0_0_conv4/block0_0_conv4", "op": "Relu"}, {"input": ["block0_0_conv4/block0_0_conv4", "block0_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block0_0_reshape0", "op": "Reshape"}, {"input": ["block0_0_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_0_transpose", "op": "Transpose"}, {"input": ["block0_0_transpose", "block0_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block0_0_reshape1", "op": "Reshape"}, {"input": ["block0_0_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_1_slice-Slice0", "op": "Slice"}, {"input": ["block0_0_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_1_slice-Slice1", "op": "Slice"}, {"input": ["block0_1_slice-Slice1", "block0_1_conv0/weights", "block0_1_conv0/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block0_1_conv0/block0_1_conv0", "op": "_FusedConv2D"}, {"input": ["block0_1_conv0/block0_1_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block0_1_conv1/pad_size", "op": "Pad"}, {"input": ["block0_1_conv1/pad_size", "block0_1_conv1/weights", "block0_1_conv1/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}}, "name": "block0_1_conv1/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block0_1_conv1/depthwise", "block0_1_conv2/weights", "block0_1_conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}}, "name": "block0_1_conv2/block0_1_conv2", "op": "_FusedConv2D"}, {"input": ["block0_1_slice-Slice0", "block0_1_conv2/block0_1_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}, "name": "block0_1_concat", "op": "ConcatV2"}, {"input": ["block0_1_concat", "block0_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block0_1_reshape0", "op": "Reshape"}, {"input": ["block0_1_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_1_transpose", "op": "Transpose"}, {"input": ["block0_1_transpose", "block0_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block0_1_reshape1", "op": "Reshape"}, {"input": ["block0_1_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_2_slice-Slice0", "op": "Slice"}, {"input": ["block0_1_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_2_slice-Slice1", "op": "Slice"}, {"input": ["block0_2_slice-Slice1", "block0_2_conv0/weights", "block0_2_conv0/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}}, "name": "block0_2_conv0/block0_2_conv0", "op": "_FusedConv2D"}, {"input": ["block0_2_conv0/block0_2_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block0_2_conv1/pad_size", "op": "Pad"}, {"input": ["block0_2_conv1/pad_size", "block0_2_conv1/weights", "block0_2_conv1/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}}, "name": "block0_2_conv1/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block0_2_conv1/depthwise", "block0_2_conv2/weights", "block0_2_conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block0_2_conv2/block0_2_conv2", "op": "_FusedConv2D"}, {"input": ["block0_2_slice-Slice0", "block0_2_conv2/block0_2_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}, "name": "block0_2_concat", "op": "ConcatV2"}, {"input": ["block0_2_concat", "block0_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block0_2_reshape0", "op": "Reshape"}, {"input": ["block0_2_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_2_transpose", "op": "Transpose"}, {"input": ["block0_2_transpose", "block0_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block0_2_reshape1", "op": "Reshape"}, {"input": ["block0_2_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_3_slice-Slice0", "op": "Slice"}, {"input": ["block0_2_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_3_slice-Slice1", "op": "Slice"}, {"input": ["block0_3_slice-Slice1", "block0_3_conv0/weights", "block0_3_conv0/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block0_3_conv0/block0_3_conv0", "op": "_FusedConv2D"}, {"input": ["block0_3_conv0/block0_3_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block0_3_conv1/pad_size", "op": "Pad"}, {"input": ["block0_3_conv1/pad_size", "block0_3_conv1/weights", "block0_3_conv1/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}, "name": "block0_3_conv1/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block0_3_conv1/depthwise", "block0_3_conv2/weights", "block0_3_conv2/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block0_3_conv2/block0_3_conv2", "op": "_FusedConv2D"}, {"input": ["block0_3_slice-Slice0", "block0_3_conv2/block0_3_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}, "name": "block0_3_concat", "op": "ConcatV2"}, {"input": ["block0_3_concat", "block0_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block0_3_reshape0", "op": "Reshape"}, {"input": ["block0_3_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block0_3_transpose", "op": "Transpose"}, {"input": ["block0_3_transpose", "block0_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block0_3_reshape1", "op": "Reshape"}, {"input": ["block0_3_reshape1", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block1_0_conv3/pad_size", "op": "Pad"}, {"input": ["block0_3_reshape1", "block1_0_conv0/weights", "block1_0_conv0/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block1_0_conv0/block1_0_conv0", "op": "_FusedConv2D"}, {"input": ["block1_0_conv3/pad_size", "block1_0_conv3/weights", "block1_0_conv3/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}, "name": "block1_0_conv3/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block1_0_conv0/block1_0_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block1_0_conv1/pad_size", "op": "Pad"}, {"input": ["block1_0_conv1/pad_size", "block1_0_conv1/weights", "block1_0_conv1/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}}, "name": "block1_0_conv1/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block1_0_conv3/depthwise", "block1_0_conv4/weights", "block1_0_conv4/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block1_0_conv4/BiasAdd", "op": "_FusedConv2D"}, {"input": ["block1_0_conv1/depthwise", "block1_0_conv2/weights", "block1_0_conv2/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block1_0_conv2/BiasAdd", "op": "_FusedConv2D"}, {"input": ["block1_0_conv4/BiasAdd", "block1_0_conv2/BiasAdd", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}, "name": "block1_0_concat", "op": "ConcatV2"}, {"input": ["block1_0_concat"], "attr": {"T": {"type": "DT_FLOAT"}}, "name": "block1_0_conv4/block1_0_conv4", "op": "Relu"}, {"input": ["block1_0_conv4/block1_0_conv4", "block1_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block1_0_reshape0", "op": "Reshape"}, {"input": ["block1_0_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block1_0_transpose", "op": "Transpose"}, {"input": ["block1_0_transpose", "block1_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block1_0_reshape1", "op": "Reshape"}, {"input": ["block1_0_reshape1", "block0_1_slice-Slice0/begin", "block1_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block1_1_slice-Slice0", "op": "Slice"}, {"input": ["block1_0_reshape1", "block1_1_slice-Slice1/begin", "block1_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block1_1_slice-Slice1", "op": "Slice"}, {"input": ["block1_1_slice-Slice1", "block1_1_conv0/weights", "block1_1_conv0/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block1_1_conv0/block1_1_conv0", "op": "_FusedConv2D"}, {"input": ["block1_1_conv0/block1_1_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block1_1_conv1/pad_size", "op": "Pad"}, {"input": ["block1_1_conv1/pad_size", "block1_1_conv1/weights", "block1_1_conv1/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}}, "name": "block1_1_conv1/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block1_1_conv1/depthwise", "block1_1_conv2/weights", "block1_1_conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}, "name": "block1_1_conv2/block1_1_conv2", "op": "_FusedConv2D"}, {"input": ["block1_1_slice-Slice0", "block1_1_conv2/block1_1_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}, "name": "block1_1_concat", "op": "ConcatV2"}, {"input": ["block1_1_concat", "block1_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block1_1_reshape0", "op": "Reshape"}, {"input": ["block1_1_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block1_1_transpose", "op": "Transpose"}, {"input": ["block1_1_transpose", "block1_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block1_1_reshape1", "op": "Reshape"}, {"input": ["block1_1_reshape1", "block0_1_slice-Slice0/begin", "block1_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block1_2_slice-Slice0", "op": "Slice"}, {"input": ["block1_1_reshape1", "block1_1_slice-Slice1/begin", "block1_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block1_2_slice-Slice1", "op": "Slice"}, {"input": ["block1_2_slice-Slice1", "block1_2_conv0/weights", "block1_2_conv0/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}}, "name": "block1_2_conv0/block1_2_conv0", "op": "_FusedConv2D"}, {"input": ["block1_2_conv0/block1_2_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}, "name": "block1_2_conv1/pad_size", "op": "Pad"}, {"input": ["block1_2_conv1/pad_size", "block1_2_conv1/weights", "block1_2_conv1/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}}, "name": "block1_2_conv1/depthwise", "op": "FusedDepthwiseConv2dNative"}, {"input": ["block1_2_conv1/depthwise", "block1_2_conv2/weights", "block1_2_conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}}, "name": "block1_2_conv2/block1_2_conv2", "op": "_FusedConv2D"}, {"input": ["block1_2_slice-Slice0", "block1_2_conv2/block1_2_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}, "name": "block1_2_concat", "op": "ConcatV2"}, {"input": ["block1_2_concat", "block1_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}, "name": "block1_2_reshape0", "op": "Reshape"}, {"input": ["block1_2_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "name": "block1_2_transpose", "op": 