{"userDefinedMetadata": {"signature": {"outputs": {"loss:0": {"name": "loss:0"}}}}, "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [3, 3, 232, 1], "name": "block2_0_conv3/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_0_conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_0_conv4/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_0_conv4/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_0_conv3/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_0_conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_0_conv4/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_0_conv4/biases"}, {"dtype": "int32", "shape": [4], "name": "block0_1_slice-Slice0/begin"}, {"dtype": "float32", "shape": [3, 3, 24, 1], "name": "block0_0_conv3/weights"}, {"dtype": "float32", "shape": [24], "name": "block0_0_conv3/biases"}, {"dtype": "float32", "shape": [1, 1, 24, 58], "name": "block0_0_conv4/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_0_conv4/biases"}, {"dtype": "float32", "shape": [3], "name": "data_bn/data_bn/Rsqrt/_0__cf__0"}, {"dtype": "float32", "shape": [3], "name": "data_bn/data_bn/mul_1/_1__cf__1"}, {"dtype": "float32", "shape": [3, 3, 3, 24], "name": "conv0/weights"}, {"dtype": "float32", "shape": [24], "name": "conv0/biases"}, {"dtype": "float32", "shape": [1, 1, 24, 58], "name": "block0_0_conv0/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_0_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 58, 1], "name": "block0_0_conv1/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_0_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 58, 58], "name": "block0_0_conv2/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_0_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 58, 58], "name": "block0_1_conv0/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_1_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 58, 1], "name": "block0_1_conv1/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_1_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 58, 58], "name": "block0_1_conv2/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_1_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 58, 58], "name": "block0_2_conv0/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_2_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 58, 1], "name": "block0_2_conv1/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_2_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 58, 58], "name": "block0_2_conv2/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_2_conv2/biases"}, {"dtype": "int32", "shape": [4], "name": "block0_1_slice-Slice1/begin"}, {"dtype": "int32", "shape": [4], "name": "block0_1_slice-Slice0/size"}, {"dtype": "float32", "shape": [1, 1, 58, 58], "name": "block0_3_conv0/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_3_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 58, 1], "name": "block0_3_conv1/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_3_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 58, 58], "name": "block0_3_conv2/weights"}, {"dtype": "float32", "shape": [58], "name": "block0_3_conv2/biases"}, {"dtype": "int32", "shape": [4], "name": "block0_0_reshape0/shape"}, {"dtype": "int32", "shape": [4], "name": "block0_0_reshape1/shape"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_0_conv0/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_0_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_0_conv1/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_0_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_0_conv2/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_0_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_1_conv0/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_1_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_1_conv1/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_1_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_1_conv2/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_1_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_2_conv0/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_2_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_2_conv1/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_2_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_2_conv2/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_2_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_3_conv0/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_3_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_3_conv1/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_3_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_3_conv2/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_3_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_4_conv0/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_4_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_4_conv1/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_4_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_4_conv2/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_4_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_5_conv0/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_5_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_5_conv1/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_5_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_5_conv2/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_5_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_6_conv0/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_6_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_6_conv1/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_6_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_6_conv2/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_6_conv2/biases"}, {"dtype": "int32", "shape": [4], "name": "block1_1_slice-Slice1/begin"}, {"dtype": "int32", "shape": [4], "name": "block1_1_slice-Slice0/size"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_7_conv0/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_7_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 116, 1], "name": "block1_7_conv1/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_7_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 116, 116], "name": "block1_7_conv2/weights"}, {"dtype": "float32", "shape": [116], "name": "block1_7_conv2/biases"}, {"dtype": "int32", "shape": [4], "name": "block1_0_reshape0/shape"}, {"dtype": "int32", "shape": [4], "name": "block1_0_reshape1/shape"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_0_conv0/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_0_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 232, 1], "name": "block2_0_conv1/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_0_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_0_conv2/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_0_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_1_conv0/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_1_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 232, 1], "name": "block2_1_conv1/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_1_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_1_conv2/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_1_conv2/biases"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_2_conv0/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_2_conv0/biases"}, {"dtype": "float32", "shape": [3, 3, 232, 1], "name": "block2_2_conv1/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_2_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_2_conv2/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_2_conv2/biases"}, {"dtype": "int32", "shape": [4], "name": "block2_1_slice-Slice1/begin"}, {"dtype": "int32", "shape": [4], "name": "block2_1_slice-Slice0/size"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_3_conv0/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_3_conv0/biases"}, {"dtype": "int32", "shape": [4, 2], "name": "conv0/pad_size/paddings"}, {"dtype": "float32", "shape": [3, 3, 232, 1], "name": "block2_3_conv1/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_3_conv1/biases"}, {"dtype": "float32", "shape": [1, 1, 232, 232], "name": "block2_3_conv2/weights"}, {"dtype": "float32", "shape": [232], "name": "block2_3_conv2/biases"}, {"dtype": "int32", "shape": [], "name": "block0_0_concat/axis"}, {"dtype": "int32", "shape": [4], "name": "block2_0_reshape0/shape"}, {"dtype": "int32", "shape": [4], "name": "block0_0_transpose/perm"}, {"dtype": "int32", "shape": [4], "name": "block2_0_reshape1/shape"}, {"dtype": "float32", "shape": [1, 1, 464, 1024], "name": "conv1/weights"}, {"dtype": "float32", "shape": [2], "name": "fc/biases"}, {"dtype": "float32", "shape": [1024], "name": "conv1/biases"}, {"dtype": "int32", "shape": [2], "name": "fc/Reshape/shape"}, {"dtype": "float32", "shape": [1024, 2], "name": "fc/weights"}], "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"]}], "modelTopology": {"node": [{"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv3/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv3/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv4/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv4/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv3/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv3/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv4/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv4/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_1_slice-Slice0/begin"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv3/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv3/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv4/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv4/biases"}, {"op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "name": "Placeholder"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "data_bn/data_bn/Rsqrt/_0__cf__0"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "data_bn/data_bn/mul_1/_1__cf__1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_0_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_1_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_2_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_1_slice-Slice1/begin"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_1_slice-Slice0/size"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "58"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block0_3_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_0_reshape0/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_0_reshape1/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_0_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_1_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_2_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_3_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_4_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_5_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_6_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block1_1_slice-Slice1/begin"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block1_1_slice-Slice0/size"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "116"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block1_7_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block1_0_reshape0/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block1_0_reshape1/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_0_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_1_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_2_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block2_1_slice-Slice1/begin"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block2_1_slice-Slice0/size"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv0/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv0/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "conv0/pad_size/paddings"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv2/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "232"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "block2_3_conv2/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_0_concat/axis"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block2_0_reshape0/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block0_0_transpose/perm"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "block2_0_reshape1/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "464"}, {"size": "1024"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv1/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "fc/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1024"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv1/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "fc/Reshape/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1024"}, {"size": "2"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "fc/weights"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Mul", "input": ["Placeholder", "data_bn/data_bn/Rsqrt/_0__cf__0"], "name": "data_bn/data_bn/mul"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Add", "input": ["data_bn/data_bn/mul", "data_bn/data_bn/mul_1/_1__cf__1"], "name": "data_bn/data_bn/add_1"}, {"attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Pad", "input": ["data_bn/data_bn/add_1", "conv0/pad_size/paddings"], "name": "conv0/pad_size"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "op": "_FusedConv2D", "input": ["conv0/pad_size", "conv0/weights", "conv0/biases"], "device": "/device:CPU:0", "name": "conv0/conv0"}, {"attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Pad", "input": ["conv0/conv0", "conv0/pad_size/paddings"], "name": "pad_size"}, {"attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "op": "MaxPool", "input": ["pad_size"], "name": "pool0"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "op": "_FusedConv2D", "input": ["pool0", "block0_0_conv0/weights", "block0_0_conv0/biases"], "device": "/device:CPU:0", "name": "block0_0_conv0/block0_0_conv0"}, {"attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Pad", "input": ["pool0", "conv0/pad_size/paddings"], "name": "block0_0_conv3/pad_size"}, {"attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Pad", "input": ["block0_0_conv0/block0_0_conv0", "conv0/pad_size/paddings"], "name": "block0_0_conv1/pad_size"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "op": "FusedDepthwiseConv2dNative", "input": ["block0_0_conv3/pad_size", "block0_0_conv3/weights", "block0_0_conv3/biases"], "name": "block0_0_conv3/depthwise"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "op": "FusedDepthwiseConv2dNative", "input": ["block0_0_conv1/pad_size", "block0_0_conv1/weights", "block0_0_conv1/biases"], "name": "block0_0_conv1/depthwise"}, {"attr": {"num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "op": "_FusedConv2D", "input": ["block0_0_conv3/depthwise", "block0_0_conv4/weights", "block0_0_conv4/biases"], "device": "/device:CPU:0", "name": "block0_0_conv4/BiasAdd"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "op": "_FusedConv2D", "input": ["block0_0_conv1/depthwise", "block0_0_conv2/weights", "block0_0_conv2/biases"], "device": "/device:CPU:0", "name": "block0_0_conv2/BiasAdd"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "op": "ConcatV2", "input": ["block0_0_conv4/BiasAdd", "block0_0_conv2/BiasAdd", "block0_0_concat/axis"], "name": "block0_0_concat"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Relu", "input": ["block0_0_concat"], "name": "block0_0_conv4/block0_0_conv4"}, {"attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Reshape", "input": ["block0_0_conv4/block0_0_conv4", "block0_0_reshape0/shape"], "name": "block0_0_reshape0"}, {"attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Transpose", "input": ["block0_0_reshape0", "block0_0_transpose/perm"], "name": "block0_0_transpose"}, {"attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Reshape", "input": ["block0_0_transpose", "block0_0_reshape1/shape"], "name": "block0_0_reshape1"}, {"attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Slice", "input": ["block0_0_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "name": "block0_1_slice-Slice0"}, {"attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Slice", "input": ["block0_0_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "name": "block0_1_slice-Slice1"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "op": "_FusedConv2D", "input": ["block0_1_slice-Slice1", "block0_1_conv0/weights", "block0_1_conv0/biases"], "device": "/device:CPU:0", "name": "block0_1_conv0/block0_1_conv0"}, {"attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Pad", "input": ["block0_1_conv0/block0_1_conv0", "conv0/pad_size/paddings"], "name": "block0_1_conv1/pad_size"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "op": "FusedDepthwiseConv2dNative", "input": ["block0_1_conv1/pad_size", "block0_1_conv1/weights", "block0_1_conv1/biases"], "name": "block0_1_conv1/depthwise"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "op": "_FusedConv2D", "input": ["block0_1_conv1/depthwise", "block0_1_conv2/weights", "block0_1_conv2/biases"], "device": "/device:CPU:0", "name": "block0_1_conv2/block0_1_conv2"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "op": "ConcatV2", "input": ["block0_1_slice-Slice0", "block0_1_conv2/block0_1_conv2", "block0_0_concat/axis"], "name": "block0_1_concat"}, {"attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Reshape", "input": ["block0_1_concat", "block0_0_reshape0/shape"], "name": "block0_1_reshape0"}, {"attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Transpose", "input": ["block0_1_reshape0", "block0_0_transpose/perm"], "name": "block0_1_transpose"}, {"attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Reshape", "input": ["block0_1_transpose", "block0_0_reshape1/shape"], "name": "block0_1_reshape1"}, {"attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Slice", "input": ["block0_1_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "name": "block0_2_slice-Slice0"}, {"attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Slice", "input": ["block0_1_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "name": "block0_2_slice-Slice1"}, {"attr": {"num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "op": "_FusedConv2D", "input": ["block0_2_slice-Slice1", "block0_2_conv0/weights", "block0_2_conv0/biases"], "device": "/device:CPU:0", "name": "block0_2_conv0/block0_2_conv0"}, {"attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Pad", "input": ["block0_2_conv0/block0_2_conv0", "conv0/pad_size/paddings"], "name": "block0_2_conv1/pad_size"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "op": "FusedDepthwiseConv2dNative", "input": ["block0_2_conv1/pad_size", "block0_2_conv1/weights", "block0_2_conv1/biases"], "name": "block0_2_conv1/depthwise"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "op": "_FusedConv2D", "input": ["block0_2_conv1/depthwise", "block0_2_conv2/weights", "block0_2_conv2/biases"], "device": "/device:CPU:0", "name": "block0_2_conv2/block0_2_conv2"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "op": "ConcatV2", "input": ["block0_2_slice-Slice0", "block0_2_conv2/block0_2_conv2", "block0_0_concat/axis"], "name": "block0_2_concat"}, {"attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Reshape", "input": ["block0_2_concat", "block0_0_reshape0/shape"], "name": "block0_2_reshape0"}, {"attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Transpose", "input": ["block0_2_reshape0", "block0_0_transpose/perm"], "name": "block0_2_transpose"}, {"attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Reshape", "input": ["block0_2_transpose", "block0_0_reshape1/shape"], "name": "block0_2_reshape1"}, {"attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Slice", "input": ["block0_2_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "name": "block0_3_slice-Slice0"}, {"attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Slice", "input": ["block0_2_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "name": "block0_3_slice-Slice1"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "op": "_FusedConv2D", "input": ["block0_3_slice-Slice1", "block0_3_conv0/weights", "block0_3_conv0/biases"], "device": "/device:CPU:0", "name": "block0_3_conv0/block0_3_conv0"}, {"attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Pad", "input": ["block0_3_conv0/block0_3_conv0", "conv0/pad_size/paddings"], "name": "block0_3_conv1/pad_size"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}, "op": "FusedDepthwiseConv2dNative", "input": ["block0_3_conv1/pad_size", "block0_3_conv1/weights", "block0_3_conv1/biases"], "name": "block0_3_conv1/depthwise"}, {"attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}, "op": "_FusedConv2D", "input": ["block0_3_conv1/depthwise", "block0_3_conv2/weights", "block0_3_conv2/biases"], "device": "/device:CPU:0", "name": "block0_3_conv2/block0_3_conv2"}, {"attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "op": "ConcatV2", "input": ["block0_3_slice-Slice0", "block0_3_conv2/block0_3_conv2", "block0_0_concat/axis"], 